
import movie1 from "../img/movie-1.jpg";
import movie2 from "../img/movie-2.jpeg";
import movie3 from "../img/movie-3.jpg";
import movie4 from "../img/movie-4.jpg";
import movie5 from "../img/movie-5.jpg";
import movie6 from "../img/movie-6.png";
import movie7 from "../img/movie-7.jpg";
import movie8 from "../img/movie-8.jpg";
import movie9 from "../img/movie-9.jpg";
import movie10 from "../img/movie-10.jpg";
import movie11 from "../img/movie-11.jpeg";
import movie12 from "../img/movie-12.jpg";
import movie13 from "../img/movie-13.jpg";
import movie14 from "../img/movie-14.jpg";
import movie15 from "../img/movie-15.jpg";
import movie16 from "../img/movie-16.jpg";
import movie17 from "../img/movie-17.jpg";
import movie18 from "../img/movie-18.jpg";
import movie19 from "../img/movie-19.jpg";
import movie20 from "../img/movie-20.jpeg";

export const movies = [
    {
        name: "全家就是米家",
        img: movie1,
        detail: "為了清償債務，老爸大衛必須變成走私大麻的毒梟，把布萊德的最新一批貨從墨西哥運回美國來，於是威脅利誘幾位鄰居幫忙，分別是尖酸刻薄的脫衣舞孃羅絲、肖想抽大麻的肯尼及龐克打扮的不良少女凱西。大衛想出絕佳的走私計劃，假老婆、假小孩跟很炫的大型休旅車，組成「米氏一家」要去南部邊界度假。",
        type: "comedy"
    },
    {
        name: "戀夏500日",
        img: movie2,
        detail: "顛覆「真愛命中註定」的劇本，《戀夏500日》的男主角相信女主角是真命天女，生活中的一切因她出現而變得完美，只不過這似乎都是他自導自演的小劇場。看完後會明白「夏天走了，秋天就會到來」的道理，屬失戀必看的療癒佳作。",
        type: "romantic"
    },
    {
        name: "死侍",
        img: movie3,
        detail: "如果不是粗俗，暴力，和吐槽的結合，這部電影可能就不會如此精彩。這部電影顛覆了我們對漫畫改編電影的期望，同時享受了帶有上世紀80年代荒謬感的嬉皮士風格。 這是一個小規模，充滿恐怖的復仇驚悚片，也擁有驚人的感情戲份。 《死侍》通過被R評級打擊的利基角色，吸引了大量的主流觀眾，並且產生了瘋狂的票房收益， 這是很多主流媒體始料未及的。",
        type: "hero"
    },
    {
        name: "王牌天神",
        img: movie4,
        detail: "這部片要有點年紀才知道（淚），現在的小孩還認識美國周星馳——金凱瑞（Jim Carrey）嗎？片中一位諸事不順的電視台播報員，把所有的發生的衰事全都怪給「上帝」，於是，上帝決定出讓一個星期的管理權給金凱瑞，讓他嚐嚐掌管全世界的感覺。於是金凱瑞開始濫用他的權利，搞的全世界雞飛狗跳，上帝也是個笑點。",
        type: "comedy"
    },
    {
        name: "戰慄遊戲",
        img: movie5,
        detail: "凱西貝茲封后之作，飾演歇斯底里、喜怒無常的瘋狂書迷真是入木三分，演技表現無從挑剔，而「安妮」這角色絕對排得進影史最佳女反派前三名，堪為經典中的經典！",
        type: "horror"
    },
    {
        name: "愛是您，愛是我",
        img: movie6,
        detail: "2003年齊聚多位大銀幕A咖演出的《愛是您，愛是我》，在2021年重新上映數位修復版後，再次溫暖了不少影迷的心。由9條支線交織出的感情糾葛，看到了愛情的圓滿、遺憾、和解等多種面向，並在最後播送著「愛無所不在」，賦予人相信愛情的勇氣與希望。",
        type: "romantic"
    },
    {
        name: "奇異博士",
        img: movie7,
        detail: "奇異博士標誌著漫威的另一個第一：完全引入魔法後幾年，那些特定的力量被限制。儘管這部電影與鋼鐵俠一樣，都是講述其傲慢的主角學習如何真正地幫助世界（使用神秘藝術），但奇異博士仍然與過去的漫威電影非常不同。這裡，你不總是需要拳頭或暴力來擊敗對手。奇異博士不僅是一個堅實的起源故事，而且將永遠為漫威打開一個新的角落，為未來的電影深入探索打下堅實的基礎，並承包一整片荷塘。",
        type: "hero"
    },
    {
        name: "醉後大丈夫",
        img: movie8,
        detail: "單身派對的橋段一定會有好笑的基本分，尤其是一群胡鬧成性的好哥們，結婚前兩天，道格跟三位伴郎，四個人開車到拉斯維加斯，打算展開他們畢生難忘的通宵狂歡派對。三位伴郎隔天起來頭痛欲裂，前天玩太瘋根本什麼都不記得，這時新郎竟然不見了！他們必須設法回想前晚幹了什麼蠢事，弄懂到底犯了哪些錯，以求能及時找到道格，使他能夠趕回洛杉磯參加自己的婚禮，荒唐至極。",
        type: "comedy"
    },
    {
        name: "鋼鐵人",
        img: movie9,
        detail: "我們已經看到了許多被鑄造了多年的偉大超級英雄，但可以說，選擇小羅伯特·唐尼扮演托尼·斯塔克，完全使我們內心的想像和憧憬得以實現。擁有一個偉大的角色，和一個經典的拯救故事，整部電影使得鋼鐵俠拜託了漫畫時期的默默無聞，一躍成為世界上最知名的超級英雄之一。 這部電影真正迎來了漫畫改編電影世界的新時代，並繼續成為最好的電影之一。",
        type: "hero"
    },
    {
        name: "孤兒怨",
        img: movie10,
        detail: "在超自然電影中，周遭的人因為不相信主角的經歷而一一遇害的橋段，總是最令人感到無比驚恐與絕望，同樣的公式套用在驚悚電影中一樣適用，只不過人性的險惡，往往比超自然的力量更加駭人...",
        type: "horror"
    },
    {
        name: "我就要你好好的",
        img: movie11,
        detail: "改變自暢銷小說、由艾蜜莉亞克拉克、山姆克萊弗林兩位高顏值演員組合演出的《我就要你好好的》，敘述四肢癱瘓的男主角愛上看護女主角，兩人因為彼此卸下心房並成長。即便不是Happy Ending，卻仍能獲得高分評價。祝福你我在經歷過每段愛情後，都能從中汲取養分、成為更好的人。",
        type: "romantic"
    },
    {
        name: "小姐好白",
        img: movie12,
        detail: "兩個黑人FBI警探奉令保護兩位千金大小姐，突發奇想決定扮成他們，找來化妝專家大改造，人高馬大的黑人漢子變成金髮白妞，光是反差就可以笑爛嘴巴。這時挑戰才真正開始，他們必須穿著迷你裙跟高跟鞋，以名媛的身分混入大型時尚派對，居然還騙得過兩位千金的死對頭，一連串變裝引發的笑點根本像轟炸。",
        type: "comedy"
    },
    {
        name: "奪魂鋸",
        img: movie13,
        detail: "當不珍惜生命或違背良知的行為受到法外的制裁，若求生所要付出的代價比死亡更加慘痛，你會選擇束手輕易求死或咬牙奮力一搏？！行影過程血腥殘酷，畫面怵目驚心，卻也令人再次反思生命的意義。開場便以一個很有威力的方式揭開序幕，吸引觀眾全神貫注，雖然是小成本製片，卻帶來料想不到的大驚喜！",
        type: "horror"
    },
    {
        name: "全家玩到趴",
        img: movie14,
        detail: "原本是個死氣沉沉的家庭，老爸羅斯想給家人一個永生難忘的美好假期，於是他大手筆入手新車，向家人宣告一場跨州的長途旅程即將展開，帶著全家人回到他三十年前最愛的「挖哩咧樂園」！這一路走來簡直荒謬，完全超乎原來的旅行計劃，被大型貨櫃車追逐，騎著四輪車在草原上奔馳，泛舟遇到瘋子，最後終於抵達「挖哩咧樂園」。",
        type: "comedy"
    },
    {
        name: "復仇者聯盟",
        img: movie15,
        detail: "在2006年，漫威就開始規劃一些令人難以置信的雄心勃勃的大事件，這不嚳於一枚枚引爆世界的炸彈。這個想法就是發布一系列單獨的超級英雄電影，而且每個人都為一個最終的合體電影「復仇者聯盟」提供單元人物。 從英雄之間的輝煌的笑聲，到湯姆希德勒斯頓的惡魔洛基的完美的惡棍，到其史詩般震撼人心的場面，關於這部電影的的一切是樂趣橫生和驚心動魄兩者的結合。 這是一個會被粉絲們談論幾十年，重複一遍又一遍的電影，它將永遠被認為是歷史上最偉大的電影事件之一。",
        type: "hero"
    },
    {
        name: "蜘蛛人2",
        img: movie16,
        detail: "續集往往可以獲得開發更多事件的權力。在第2部籌劃的時候的時候，創意團隊能夠放棄強制性的起源故事，把故事轉接，這是個了不起的舉動，而正是如此，也解釋了為什麼我們崇拜Sam Raimi的「蜘蛛人2」，這讓觀眾們沉浸在年輕的彼得·帕克的複雜領域，以及他為維持社交生活所付出的痛苦的努力。",
        type: "hero"
    },
    {
        name: "第六感追緝令",
        img: movie17,
        detail: "犯罪驚悚電影的經典代表，聰明睿智的劇本，將人性解放、慾望宣洩與情感拆解這三大層次揉合進懸疑迷霧之中，非常引人入勝！視覺畫面處理起來震攝人心、血脈賁張，情節張力十足。值得一提的是，只要觀賞過本片，肯定難以忘卻莎朗史東那般美艷媚惑！",
        type: "horror"
    },
    {
        name: "驚聲尖笑",
        img: movie18,
        detail: "以惡搞經典影片為主，前後出了五集，到後面有些後繼無力，最經典的還是前三部，我個人推第一集，將90年代的電影全部拙劣地愚弄一番，其中包括《驚聲尖叫》三部曲、《是誰搞的鬼》、《厄夜叢林》、《刺激驚爆點》甚至《莎翁情史》也被拿來大開玩笑，已經不是胡鬧等級，而是超專業的綜藝搞笑。",
        type: "comedy"
    },
    {
        name: "美國隊長3：英雄內戰",
        img: movie19,
        detail: "當發現美隊3將幾乎所有的超級英雄都聚集起來時，影迷立即暱稱它為《復仇者2.5》。但是，三條主線終究是沒有辦法擰成一個。同時，雖然故事的主體主要是圍繞史蒂夫·羅傑斯的個人奮鬥，但他們還是給了所有的英雄足夠的時間展示自己，特別是對於新來的黑豹和蜘蛛俠。 儘管演員眾多，但我們從來沒有感到擁擠，每個主角都有自己獨特的角色，可以說是獨特的人物組成了複雜的故事。",
        type: "hero"
    },
    {
        name: "愛",
        img: movie20,
        detail: "2012年、由鈕承澤執導的《愛》，齊聚舒淇、趙薇、阮經天、趙又廷、彭于晏、 郭采潔、陳意涵等多位演員，道出愛情裡的多種面向：三角戀、苦戀、姐弟戀或懸殊身份的愛侶等等，觀影後會對「愛」又更廣也更深的省思，當然也會想來一場刻苦銘心的感情。",
        type: "romantic"
    }
]